Revit 2024 API
ReferenceIntersector.ViewId Property
 The id of the 3D view used for evaluation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId ViewId { get; set; }
Visual Basic
Public Property ViewId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ ViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: viewId is not the id of a 3D view.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ReferenceIntersector Class
Autodesk.Revit.DB Namespace